package cn.wenyan.compiler;


import cn.wenyan.compiler.command.CommandHandler;



public class Main {

    public static void main(String[] args) throws Exception{
        if (args.length == 0){
            CommandHandler.compileCommand.entrySet().stream().forEach(x->System.out.println(x.getValue().getOption()+": "+x.getValue().getClass().getSimpleName()));
        }
        WenYanCompiler compiler = new WenYanCompilerImpl(false);
        compiler.compile(args);
        String code = ("吾有一言。曰「「問天地好在。」」。書之。\n" +
                "有數三十。名之曰「甲」。\n" +
                "吾有三言。曰「「甲之數」」。曰「甲」。曰「「也」」。書之。\n" +
                "\n" +
                "批曰。「「文氣淋灕。字句切實」」。\n" +
                "\n" +
                "吾有二爻。曰陽。曰陰。名之曰「天」。曰「地」。\n" +
                "夫「天」「地」中無陰乎。夫「天」「地」中有陽乎。噫。\n" +
                "變「天」。名之曰「人」。\n" +
                "\n" +
                "減「甲」以一。加「甲」以二。名之曰「乙」。曰「丙」。\n" +
                "\n" +
                "吾有一列。名之曰「丁」。\n" +
                "充「丁」以一。以二。以三。以四。\n" +
                "\n" +
                "有數一。名之曰「戊」。\n" +
                "恆為是。\n" +
                "\t若「戊」等於「甲」者。\n" +
                "\t\t乃止\n" +
                "\t也。\n" +
                "\t吾有一言。曰「戊」。書之。\n" +
                "\t加一以「戊」。昔之「戊」者。今其是矣。\n" +
                "云云。\n" +
                "\n" +
                "吾有一術。名之曰「階乘」。欲行是術。必先得一數。曰「甲」。乃行是術曰。\n" +
                "\t若「甲」等於一者。\n" +
                "\t\t乃得「甲」。\n" +
                "\t若非。\n" +
                "\t\t減「甲」以一。名之曰「乙」。\n" +
                "\t\t施「階乘」於「乙」。名之曰「丙」。\n" +
                "\t\t乘「丙」以「甲」。名之曰「丁」。\n" +
                "\t\t乃得「丁」\n" +
                "\t也。\n" +
                "是謂「階乘」之術也。\n" +
                "\n" +
                "吾有一術。名之曰「異或」。欲行是術。必先得二爻。曰「甲」。曰「乙」。乃行是術曰。\n" +
                "\t若「甲」等於「乙」者。\n" +
                "\t\t乃得陰。\n" +
                "\t若非。\n" +
                "\t\t乃得陽\n" +
                "\t也。\n" +
                "是謂「異或」之術也。\n" +
                "\n" +
                "吾有一術。名之曰「快排」。欲行是術。必先得一列。曰「甲」。乃行是術曰。\n" +
                "\t若「甲」之長不大於一者。\n" +
                "\t\t乃得「甲」\n" +
                "\t也。\n" +
                "\t吾有三列。名之曰「首」。曰「頷」。曰「尾」。\n" +
                "\n" +
                "\t夫「甲」之一。名之曰「甲一」。\n" +
                "\t充「頷」以「甲一」。\n" +
                "\t夫「甲」之其餘。名之曰「甲餘」。\n" +
                "\n" +
                "\t凡「甲餘」中之「丁」。\n" +
                "\t\t若「丁」小於「甲一」者。\n" +
                "\t\t\t充「首」以「丁」。\n" +
                "\t\t若非。\n" +
                "\t\t\t充「尾」以「丁」\n" +
                "\t\t也。\n" +
                "\t云云。\n" +
                "\t施「快排」於「首」。昔之「首」者。今其是矣。\n" +
                "\t施「快排」於「尾」。昔之「尾」者。今其是矣。\n" +
                "\n" +
                "\t銜「首」以「頷」以「尾」。名之曰「乙」。\n" +
                "\t乃得「乙」。\n" +
                "\n" +
                "是謂「快排」之術也。\n" +
                "\n" +
                "吾有一列。名之曰「己」。\n" +
                "充「己」以五。以三。以二十。以八。以三十五。以七百。\n" +
                "施「快排」於「己」。書之。").replace("\t","").replace("\n","");
        compiler.runDirectly(true,code);
    }
}
